# ИТОГОВАЯ ПРОВЕРОЧНАЯ РАБОТА

Данная работа представлена для оценки полученных знаний и навыков по итогу прохождения первого блока обучения на программе разработчик.

### Задача  
Написать программу, которая из имеющегося массива строк формирует массив из строк, длинна которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Репозиторий содержит:
* блок-схему алгоритма program.drawio;
* Программу, решающую поставленную задачу program.cs

### Описание решения
Основное решение представлено в виде функций с последовательным выполнением алгоритма с использование встроенных функций языка c# и платформы .NET 7.
 foreach для перебора элементов массива и функции if для сравнения каждого элемента массива с заданным условием.

 * вызов основной функции с выводом исходного и результирующего (в последствии) массивов:

```
void main()
{
    string[] numbers = GetArray();
    System.Console.WriteLine();
    System.Console.WriteLine(string.Join(", ", numbers));
    string[] result = getNumbers(numbers);
    System.Console.WriteLine(string.Join(", ", result));
    System.Console.WriteLine();
}

main();
```

* функция получения заданного массива строк:

```
string[] GetArray()
{
    string[] array = { "hello", "world", "345", "40", "commit", "564" };
    return array;
}
```

* функция по нахождению необходимых элементов массива, организована через последовательный перебор значений исходного массива добавления элементов удолетворяющих условию в новый массив строк:
```
string[] getNumbers(string[] numbers)
{
    string[] array = new string[0];
    foreach (var number in numbers)
    {
        if (number.Length <= 3) array = array.Append(number).ToArray();
    }
    System.Console.WriteLine();
    return array;
}
```